conditionals/slides.org
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+BEAMER_FRAME_LEVEL: 1

#+BEAMER_HEADER_EXTRA: \usetheme{Warsaw}\usecolortheme{default}\useoutertheme{infolines}\setbeamercovered{transparent}
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_envargs(Env Args) %4BEAMER_col(Col) %8BEAMER_extra(Extra)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1.0 :ETC

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]

#+LaTeX_HEADER: \usepackage[english]{babel} \usepackage{ae,aecompl}
#+LaTeX_HEADER: \usepackage{mathpazo,courier,euler} \usepackage[scaled=.95]{helvet}

#+LaTeX_HEADER: \usepackage{listings}

#+LaTeX_HEADER:\lstset{language=Python, basicstyle=\ttfamily\bfseries,
#+LaTeX_HEADER:  commentstyle=\color{red}\itshape, stringstyle=\color{darkgreen},
#+LaTeX_HEADER:  showstringspaces=false, keywordstyle=\color{blue}\bfseries}

#+TITLE:    Conditionals
#+AUTHOR:    FOSSEE
#+EMAIL:     
#+DATE:    

#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:nil pri:nil tags:not-in-toc

* Outline
  In this tutorial, we shall look at
    + Using if/else blocks 
    + Using if/elif/else blocks
    + Using the Ternary conditional statement

* Question 1
  Given a number, num. Write an if else block to print num, as is, if
  it is divisible by 10, else print 10 * num.
* Solution 1
  #+begin_src python
    if num%10 == 0: 
        print num   
    else:           
        print 10*num
  #+end_src

* ~if/elif~ ladder
  #+begin_src python
    if user == 'admin':
        # Do admin operations
    elif user == 'moderator':
        # Do moderator operations
    elif user == 'client':
        # Do customer operations
  #+end_src
* Question 2
  Given a number, num. Write a ternary operator to print num, as is,
  if it is divisible by 10, else print 10 * num.
* Solution 2
  #+begin_src python
    print num if num%10 == 0 else 10*num
  #+end_src
* Summary
  In this tutorial session we learnt

    + What are conditional statements
    + if/else statement
    + if/elif/else statement
    + Ternary conditional statement - ~C if X else Y~
    + and the ~pass~ statement

* Thank you!
#+begin_latex
  \begin{block}{}
  \begin{center}
  This spoken tutorial has been produced by the
  \textcolor{blue}{FOSSEE} team, which is funded by the 
  \end{center}
  \begin{center}
    \textcolor{blue}{National Mission on Education through \\
      Information \& Communication Technology \\ 
      MHRD, Govt. of India}.
  \end{center}  
  \end{block}
#+end_latex


