conditionals/slides.tex
% Created 2010-11-10 Wed 13:25
\documentclass[presentation]{beamer}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[english]{babel} \usepackage{ae,aecompl}
\usepackage{mathpazo,courier,euler} \usepackage[scaled=.95]{helvet}
\usepackage{listings}
\lstset{language=Python, basicstyle=\ttfamily\bfseries,
commentstyle=\color{red}\itshape, stringstyle=\color{darkgreen},
showstringspaces=false, keywordstyle=\color{blue}\bfseries}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Conditionals}
\author{FOSSEE}
\date{}

\usetheme{Warsaw}\usecolortheme{default}\useoutertheme{infolines}\setbeamercovered{transparent}
\begin{document}

\maketitle









\begin{frame}
\frametitle{Outline}
\label{sec-1}

  In this tutorial, we shall look at
\begin{itemize}
\item Using if/else blocks
\item Using if/elif/else blocks
\item Using the Ternary conditional statement
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Question 1}
\label{sec-2}

  Given a number, num. Write an if else block to print num, as is, if
  it is divisible by 10, else print 10 * num.
\end{frame}
\begin{frame}[fragile]
\frametitle{Solution 1}
\label{sec-3}

\lstset{language=Python}
\begin{lstlisting}
if num%10 == 0: 
    print num   
else:           
    print 10*num
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{\texttt{if/elif} ladder}
\label{sec-4}

\lstset{language=Python}
\begin{lstlisting}
if user == 'admin':
    # Do admin operations
elif user == 'moderator':
    # Do moderator operations
elif user == 'client':
    # Do customer operations
\end{lstlisting}
\end{frame}
\begin{frame}
\frametitle{Question 2}
\label{sec-5}

  Given a number, num. Write a ternary operator to print num, as is,
  if it is divisible by 10, else print 10 * num.
\end{frame}
\begin{frame}[fragile]
\frametitle{Solution 2}
\label{sec-6}

\lstset{language=Python}
\begin{lstlisting}
print num if num%10 == 0 else 10*num
\end{lstlisting}
\end{frame}
\begin{frame}
\frametitle{Summary}
\label{sec-7}

  In this tutorial session we learnt

\begin{itemize}
\item What are conditional statements
\item if/else statement
\item if/elif/else statement
\item Ternary conditional statement - \texttt{C if X else Y}
\item and the \texttt{pass} statement
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Thank you!}
\label{sec-8}

  \begin{block}{}
  \begin{center}
  This spoken tutorial has been produced by the
  \textcolor{blue}{FOSSEE} team, which is funded by the 
  \end{center}
  \begin{center}
    \textcolor{blue}{National Mission on Education through \\
      Information \& Communication Technology \\ 
      MHRD, Govt. of India}.
  \end{center}  
  \end{block}
\end{frame}

\end{document}
